<a href="https://colab.research.google.com/github/IT-HONGREAT/studying/blob/main/pandas_Series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
import pandas as pd
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_intercativity = "all"

In [10]:
s = pd.Series([1,3,5,6,7], index = ['하나','둘','셋','넷','다섯'])
print(s)

하나    1
둘     3
셋     5
넷     6
다섯    7
dtype: int64

In [12]:
#리스트를 시리즈로 바꾸기

list_data = [1,2,3,4,5]
series = pd.Series(list_data)
print(series)
print('\n')

list_index = ['하나','둘','셋','넷','다섯']
new_series = pd.Series(list_data, index=list_index)
print(new_series)

0    1
1    2
2    3
3    4
4    5
dtype: int64


하나    1
둘     2
셋     3
넷     4
다섯    5
dtype: int64

In [14]:

tuple_data = ('판','다','스','꿀','잼')
series = pd.Series(tuple_data)
print(series)
print('\n')

tuple_index = ['하나','둘','셋','넷','다섯']
new_series = pd.Series(tuple_data, index=tuple_index)
print(new_series)

0    판
1    다
2    스
3    꿀
4    잼
dtype: object


하나    판
둘     다
셋     스
넷     꿀
다섯    잼
dtype: object

In [16]:
dict_data = {'a':1,'b':2,'c':3}
sr = pd.Series(dict_data)

print(dict_data)
print('\n')
print(type(sr))
print('\n')
print(sr)

{'a': 1, 'b': 2, 'c': 3}


<class 'pandas.core.series.Series'>


a    1
b    2
c    3
dtype: int64

In [23]:
series_data = pd.Series(['홍길동','26','010-1234-5678','경기','학생'],
                        index=['이름','나이','전화번호','거주지','직업'])

#정수형위치
num_index_data = series_data[2]
print(num_index_data)

#index 이름으로
name_index_data = series_data['전화번호']
print(name_index_data)
print()
print('전체 데이터 프레임 입니다.')
print()
print(series_data)

010-1234-5678
010-1234-5678

전체 데이터 프레임 입니다.

이름                홍길동
나이                 26
전화번호    010-1234-5678
거주지                경기
직업                 학생
dtype: object

In [25]:
series_data = pd.Series(['홍길동','26','010-1234-5678','경기','학생'],
                        index=['이름','나이','전화번호','거주지','직업'])

#정수형위치
new = series_data[[0,1,3]]
print(new)
print('\n')

new = series_data[['이름','나이','거주지']]
print(new)

이름     홍길동
나이      26
거주지     경기
dtype: object


이름     홍길동
나이      26
거주지     경기
dtype: object

In [31]:
series_data = pd.Series(['홍길동','26','010-1234-5678','경기','학생'],
                        index=['이름','나이','전화번호','거주지','직업'])

#슬라이싱
new = series_data[2:4]
print(new)
print('\n')

new = series_data['전화번호':]
print(new)

전화번호    010-1234-5678
거주지                경기
dtype: object


전화번호    010-1234-5678
거주지                경기
직업                 학생
dtype: object

In [35]:
#속성보기
new_series = pd.Series(['welcome','to','pandas'],
                       index = ['here','is','seoul'])
print(new_series.index)
print('\n')
print(new_series.values)

Index(['here', 'is', 'seoul'], dtype='object')


['welcome' 'to' 'pandas']

In [41]:
#리스트로 데이터프레임 만들기

list_data_2d = [[23,'남','부산'],[21,'여','서울'],[25,'남','광주'],[27,'여','대전'],[24,'여','광주']]

df = pd.DataFrame(list_data_2d,columns = ['나이','성별','지역']) #데이터와 columns 설정
print(df)
print('\n')

#index설정

df = pd.DataFrame(list_data_2d,
                  index = ['상우','지원','민기','정민','수림']
                  ,columns = ['나이','성별','지역'])
print(df)

   나이 성별  지역
0  23  남  부산
1  21  여  서울
2  25  남  광주
3  27  여  대전
4  24  여  광주


    나이 성별  지역
상우  23  남  부산
지원  21  여  서울
민기  25  남  광주
정민  27  여  대전
수림  24  여  광주

In [44]:
dict_data = {"나이" : [23,21,25,27,24],'성별':['남','여','남','여','여'],
             '지역':['부산','서울','광주','대전','광주']}

df = pd.DataFrame(dict_data)
print(df)
print('\n')

df = pd.DataFrame(dict_data,
                  index = ['상우','지원','민기','정민','수림'])

print(df)

   나이 성별  지역
0  23  남  부산
1  21  여  서울
2  25  남  광주
3  27  여  대전
4  24  여  광주


    나이 성별  지역
상우  23  남  부산
지원  21  여  서울
민기  25  남  광주
정민  27  여  대전
수림  24  여  광주

In [56]:
test_data = {'팀이름' : ['아자아자', '할수있다', 'AI마피아', 'TF고수', '경사하강법', '광인사최고'],
             '창의성' : ['상','중','하','상','중','하'],
             '완성도' : [100,80,70,90,50,60],
             '사업성' : ['좋음','보통','부족','보통','잘함','못함']}

df = pd.DataFrame(test_data)
df

     팀이름 창의성  완성도 사업성
0   아자아자   상  100  좋음
1   할수있다   중   80  보통
2  AI마피아   하   70  부족
3   TF고수   상   90  보통
4  경사하강법   중   50  잘함
5  광인사최고   하   60  못함

In [65]:
#1
print(df.팀이름)
print()
print(df.사업성)
#2
print(df['팀이름'])
print(df['창의성'])
#
df[['팀이름','창의성']]

0     아자아자
1     할수있다
2    AI마피아
3     TF고수
4    경사하강법
5    광인사최고
Name: 팀이름, dtype: object

0    좋음
1    보통
2    부족
3    보통
4    잘함
5    못함
Name: 사업성, dtype: object
0     아자아자
1     할수있다
2    AI마피아
3     TF고수
4    경사하강법
5    광인사최고
Name: 팀이름, dtype: object
0    상
1    중
2    하
3    상
4    중
5    하
Name: 창의성, dtype: object

     팀이름 창의성
0   아자아자   상
1   할수있다   중
2  AI마피아   하
3   TF고수   상
4  경사하강법   중
5  광인사최고   하

In [69]:
test_data = {'팀이름' : ['아자아자', '할수있다', 'AI마피아', 'TF고수', '경사하강법', '광인사최고'],
             '창의성' : ['상','중','하','상','중','하'],
             '완성도' : [100,80,70,90,50,60],
             '사업성' : ['좋음','보통','부족','보통','잘함','못함']}

df = pd.DataFrame(test_data, index = ['11팀','12팀','13팀','14팀','15팀','16팀'])

print(df.loc[['13팀']])

print(df.iloc[[3]])

       팀이름 창의성  완성도 사업성
13팀  AI마피아   하   70  부족
      팀이름 창의성  완성도 사업성
14팀  TF고수   상   90  보통

In [73]:
test_data = {'팀이름' : ['아자아자', '할수있다', 'AI마피아', 'TF고수', '경사하강법', '광인사최고'],
             '창의성' : ['상','중','하','상','중','하'],
             '완성도' : [100,80,70,90,50,60],
             '사업성' : ['좋음','보통','부족','보통','잘함','못함']}

df = pd.DataFrame(test_data, index = ['11팀','12팀','13팀','14팀','15팀','16팀'])

print(df.loc[['13팀','14팀']])
print()
print(df.iloc[[3,5]])

       팀이름 창의성  완성도 사업성
13팀  AI마피아   하   70  부족
14팀   TF고수   상   90  보통

       팀이름 창의성  완성도 사업성
14팀   TF고수   상   90  보통
16팀  광인사최고   하   60  못함

In [90]:
test_data = {'팀이름' : ['아자아자', '할수있다', 'AI마피아', 'TF고수', '경사하강법', '광인사최고'],
             '창의성' : ['상','중','하','상','중','하'],
             '완성도' : [100,80,70,90,50,60],
             '사업성' : ['좋음','보통','부족','보통','잘함','못함']}

df = pd.DataFrame(test_data, index = ['11팀','12팀','13팀','14팀','15팀','16팀'])

print(df.loc['13팀':])
print()
print(df.iloc[1:7])
print()
df.loc['12팀'::2]
df.loc['16팀'::-1]

df.iloc[2::2]

       팀이름 창의성  완성도 사업성
13팀  AI마피아   하   70  부족
14팀   TF고수   상   90  보통
15팀  경사하강법   중   50  잘함
16팀  광인사최고   하   60  못함

       팀이름 창의성  완성도 사업성
12팀   할수있다   중   80  보통
13팀  AI마피아   하   70  부족
14팀   TF고수   상   90  보통
15팀  경사하강법   중   50  잘함
16팀  광인사최고   하   60  못함

       팀이름 창의성  완성도 사업성
13팀  AI마피아   하   70  부족
15팀  경사하강법   중   50  잘함

In [93]:
#원소 선택
test_data = {'이름':['상우','현정','문영','동엽','우재'],
             '국어':[85,88,90,50,70],
             '수학':[57,90,100,78,66],
             '영어':[85,89,67,98,98],
             '과학':[93,79,92,50,70],
             '사회':[94,80,99,69,100]}

df = pd.DataFrame(test_data)
df.set_index('이름', inplace=True)
df

    국어   수학  영어  과학   사회
이름
상우  85   57  85  93   94
현정  88   90  89  79   80
문영  90  100  67  92   99
동엽  50   78  98  50   69
우재  70   66  98  70  100

In [97]:
#원소 하나 접근

df.loc[['문영'],['영어']]

    영어
이름
문영  67

In [100]:
df.iloc[[3],[2]]

    영어
이름
동엽  98

In [114]:

#원소 두개이상

df.loc[['문영'],['국어','사회']]

df.iloc[[2],[0,3]]

df.iloc[[0,3],[2]]

df.loc[['상우','동엽','우재'],['국어','영어','수학']]   #인덱스 먼저 접근해야한다. 인덱스->컬럼

    국어  영어  수학
이름
상우  85  85  57
동엽  50  98  78
우재  70  98  66

In [123]:
df.loc['현정':'동엽'],['국어','과학']

(    국어   수학  영어  과학  사회
 이름
 현정  88   90  89  79  80
 문영  90  100  67  92  99
 동엽  50   78  98  50  69, ['국어', '과학'])